%计算时间矩阵-便利算法
%% 长度为684的年月矩阵计算，起始年1958-01,共57年
a=zeros(684,1);
b=zeros(684,1);
j=1;
for i=1:57%年数
    a(j:j+11)=1958+i-1;%起始年
    b(j:j+11)=(1:12);
    j=j+12;
end
%% 长度为1788的年月矩阵计算，起始年1870-01，共149年
a=zeros(1788,1);
b=zeros(1788,1);
j=1;
for i=1:149
    a(j:j+11)=1870+i-1;
    b(j:j+11)=(1:12);
    j=j+12;
end
%% 
a=zeros(1956,1);
b=zeros(1956,1);
j=1;
for i=1:163
    a(j:j+11)=1856+i-1;
    b(j:j+11)=(1:12);
    j=j+12;
end
%% 1950开始到2019，月值数据矩阵，长度为840
a=zeros(840,1);
b=zeros(840,1);
j=1;
for i=1:70
    a(j:j+11)=1950+i-1;
    b(j:j+11)=(1:12);
    j=j+12;
end